rottenpotatoes/app/controllers/movies_controller.rb

  def index
    puts("DEBUG INDEX CALLED")
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
    end

    if params[:sort] != session[:sort] or params[:ratings] != session[:ratings]
      session[:sort] = sort
      session[:ratings] = @selected_ratings
      #redirect_to :sort => sort, :ratings => @selected_ratings and return
      # ^^ commenting out this provided line bc it screws things up?
    end

    #hw3
    if params[:director]
      dir = params[:director]
      puts("DIRECTOR SPECIFIED DEBUG", dir.to_s)
      @movies = Movie.where(rating: @selected_ratings.keys, director: dir).order(ordering)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ? AND "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')  [["director", "Bob"]]